app/controllers/b_answers_controller.rb

  def index
    @b_answers = BAnswer.all
---
SELECT "b_answers".* FROM "b_answers"

  def edit
    @b_answer = @b_question.b_answers.find(params[:id])
---
SELECT "b_answers".* FROM "b_answers" WHERE "b_answers"."b_question_id" = ? AND "b_answers"."id" = ? LIMIT 1  [["b_question_id", 1], ["id", "1"]]

  def create
    @b_answer = @b_question.b_answers.build(b_answer_params)

    respond_to do |format|
      if @b_answer.save
---
INSERT INTO "b_answers" ("answer", "b_question_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["answer", "fsad"], ["b_question_id", 1], ["created_at", Sun, 22 Dec 2013 07:04:28 UTC +00:00], ["updated_at", Sun, 22 Dec 2013 07:04:28 UTC +00:00]]

  def destroy
    @b_answer.destroy
---
DELETE FROM "b_answers" WHERE "b_answers"."id" = ?  [["id", 1]]

    def set_b_answer
      @b_answer = BAnswer.find(params[:id])
---
SELECT "b_answers".* FROM "b_answers" WHERE "b_answers"."id" = ? LIMIT 1  [["id", "1"]]

    def set_b_question
      @b_question = BQuestion.find(params[:b_question_id])
---
SELECT "b_questions".* FROM "b_questions" WHERE "b_questions"."id" = ? LIMIT 1  [["id", "1"]]