app/controllers/b_questions_controller.rb

  def index
    @b_questions = BQuestion.all
---
SELECT "b_questions".* FROM "b_questions"

  def create
    @b_question = BQuestion.new(b_question_params)

    respond_to do |format|
      if @b_question.save
---
INSERT INTO "b_questions" ("content", "created_at", "updated_at") VALUES (?, ?, ?)  [["content", "af"], ["created_at", Sun, 22 Dec 2013 06:49:59 UTC +00:00], ["updated_at", Sun, 22 Dec 2013 06:49:59 UTC +00:00]]

    def set_b_question
      @b_question = BQuestion.find(params[:id])
---
SELECT "b_questions".* FROM "b_questions" WHERE "b_questions"."id" = ? LIMIT 1  [["id", "1"]]