app/controllers/m_answers_controller.rb

SELECT "m_answers".* FROM "m_answers"
SELECT "m_questions".* FROM "m_questions" WHERE "m_questions"."id" = ? LIMIT 1  [["id", "2"]]
---
  def index
    @m_answers = MAnswer.all
    @m_question = MQuestion.find(params[:m_question_id])

SELECT "m_questions".* FROM "m_questions" WHERE "m_questions"."id" = ? LIMIT 1  [["id", "2"]]
---
  def show
    @m_question = MQuestion.find(params[:m_question_id])

SELECT "m_questions".* FROM "m_questions" WHERE "m_questions"."id" = ? LIMIT 1  [["id", "2"]]
---
  def new
    @m_question = MQuestion.find(params[:m_question_id])

SELECT "m_questions".* FROM "m_questions" WHERE "m_questions"."id" = ? LIMIT 1  [["id", "2"]]
SELECT "m_answers".* FROM "m_answers" WHERE "m_answers"."m_question_id" = ? AND "m_answers"."id" = ? LIMIT 1  [["m_question_id", 2], ["id", "6"]]
---
  def edit
    @m_question = MQuestion.find(params[:m_question_id])
    @m_answer = @m_question.m_answers.find(params[:id])

SELECT "m_questions".* FROM "m_questions" WHERE "m_questions"."id" = ? LIMIT 1  [["id", "2"]]
INSERT INTO "m_answers" ("answer", "check", "created_at", "m_question_id", "updated_at") VALUES (?, ?, ?, ?, ?)  [["answer", "answer"], ["check", true], ["created_at", Sat, 21 Dec 2013 06:10:36 UTC +00:00], ["m_question_id", 2], ["updated_at", Sat, 21 Dec 2013 06:10:36 UTC +00:00]]
---
  def create
    @m_question = MQuestion.find(params[:m_question_id])
    @m_answer = @m_question.m_answers.build(m_answer_params)
    respond_to do |format|
      if @m_answer.save

SELECT "m_questions".* FROM "m_questions" WHERE "m_questions"."id" = ? LIMIT 1  [["id", "2"]]
---
  def update
    @m_question = MQuestion.find(params[:m_question_id])

DELETE FROM "m_answers" WHERE "m_answers"."id" = ?  [["id", 2]]
---
  def destroy
    @m_answer.destroy

SELECT "m_answers".* FROM "m_answers" WHERE "m_answers"."id" = ? LIMIT 1  [["id", "6"]]
---
    def set_m_answer
      @m_answer = MAnswer.find(params[:id])