app/controllers/m_questions_controller.rb

SELECT "m_questions".* FROM "m_questions"
---
  def index
    @m_questions = MQuestion.all

INSERT INTO "m_questions" ("content", "created_at", "updated_at") VALUES (?, ?, ?)  [["content", "問題です"], ["created_at", Sat, 21 Dec 2013 05:33:37 UTC +00:00], ["updated_at", Sat, 21 Dec 2013 05:33:37 UTC +00:00]]
---
  def create
    @m_question = MQuestion.new(m_question_params)

    respond_to do |format|
      if @m_question.save

UPDATE "m_questions" SET "content" = ?, "updated_at" = ? WHERE "m_questions"."id" = 1  [["content", "問題です。"], ["updated_at", Sat, 21 Dec 2013 05:33:44 UTC +00:00]]
---
  def update
    respond_to do |format|
      if @m_question.update(m_question_params)

DELETE FROM "m_questions" WHERE "m_questions"."id" = ?  [["id", 1]]
---
  def destroy
    @m_question.destroy

SELECT "m_questions".* FROM "m_questions" WHERE "m_questions"."id" = ? LIMIT 1  [["id", "1"]]
---
    def set_m_question
      @m_question = MQuestion.find(params[:id])